---
kind: method
id: M:Autodesk.Revit.DB.ExternalService.ExternalServiceId.op_Inequality(Autodesk.Revit.DB.ExternalService.ExternalServiceId,Autodesk.Revit.DB.ExternalService.ExternalServiceId)
source: html/9115107b-21f4-4b11-aa44-cea5f22605f4.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceId.op_Inequality Method

Compares two ExternalServiceId instances.

## Syntax (C#)
```csharp
public static bool operator !=(
	ExternalServiceId first,
	ExternalServiceId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ExternalService.ExternalServiceId`) - The first ExternalServiceId.
- **second** (`Autodesk.Revit.DB.ExternalService.ExternalServiceId`) - The second ExternalServiceId.

## Returns
True if the inputs are different, false if they are identical.